#+TITLE: Leiningen 学习笔记：Clojure 项目构建与管理从入门到实战配置
#+AUTHOR: lujun9972
#+TAGS: 编程之旅,Clojure,Leiningen,构建工具
#+DATE: [2026-04-14 一]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

本文是学习 [[https://dev.to/ivangavlik/leiningen-complete-tutorial-best-practices-3f8l][Leiningen — Complete Tutorial & Best Practices]] 过程中的笔记整理。全文以一个 =greeting-api= 项目为统一示例，从零开始演示 Leiningen 的完整工作流。

** 手动激活 Profile

#+BEGIN_SRC shell :dir /tmp/greeting-api/ :results raw
  lein with-profile uberjar uberjar    # 用 :uberjar profile 打包
  lein with-profile dev,test test      # 同时激活 :dev 和 :test
#+END_SRC

#+RESULTS:
#'leiningen.core.project/project
Warning: The Main-Class specified does not exist within the jar. It may not be executable as expected. A gen-class directive may be missing in the namespace which contains the main method, or the namespace has not been AOT-compiled.
Created /tmp/greeting-api/target/greeting-api-0.1.0-SNAPSHOT.jar
Created /tmp/greeting-api/target/greeting-api-0.1.0-SNAPSHOT-standalone.jar
#'leiningen.core.project/project

lein test user

Ran 0 tests containing 0 assertions.
0 failures, 0 errors.

